Revit 2027 API
DuctFittingAndAccessoryConnectorData.Diameter Property
 The connector diameter, Units:(ft).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Diameter { get; }
Public ReadOnly Property Diameter As Double
	Get
public:
property double Diameter {
	double get ();
}
member Diameter : float with get
Property Value
Double
See Also
Reference
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace